# Найдите сумму цифр трехзначного числа.

num = input("Введите любое трехзначное число: ")
print(f"Сумма цифр трехначного числа равна {int(num[0]) + int(num[1]) + int(num[2])}")
